[
    {
        "id": 201,
        "posterUrl": "https://images.getbento.com/accounts/3aba79963eaec755ff2b03d837bda6a8/media/images/DasguptaDharam0116NY_1.jpg?w=1000&fit=max&auto=compress,format&h=1000",
        "posterSize": "'Untitled,' 1987, Acrylic on cloth, 28.5 x 21.7 in.",
        "posterName": "DHARAMANARAYAN DASGUPTA",
        "posterYear": "1939 - 1997",
        "posterDiscription": "Using parody to critique quirks of contemporary society, Dharmanarayan Dasgupta created a unique visual language that is easily identifiable with his signature, featuring sari-clad voluptuous and gratified women and dhoti-clad men. His style was an aesthetic yet skittish union of traditional Indian elements with those of the western art. In this Untitled work for instance, two women gossip about a probable beloved—as denoted by a ring in the hands of one of them—while a hopeful suitor eavesdrops from a window. The smirk on the face of the first woman, the green body of the other, the pink face of the man—all add an element of mirth to the narrative."
    },
    {
        "id": 202,
        "posterUrl": "https://images.getbento.com/accounts/3aba79963eaec755ff2b03d837bda6a8/media/images/santosh.jpg?w=1000&fit=max&auto=compress,format&h=1000",
        "posterSize": "'Untitled,' Oil on canvas, 38.7 x 36.5 in.",
        "posterName": "G.R. SANTOSH",
        "posterDiscription": "The name of G. R. Santosh is synonymous with the neo-Tantra art movement, which he spearheaded after an epiphany at the shrine of Shiva in the Amarnath cave in his native Kashmir in 1964. Santosh’s philosophical explorations gave birth to an artistic vocabulary that is well delineated in this Untitled work. At the center is a square, denoting the universe that contains a large dot, symbolizing procreation, or the beginning of life. It is also the dot to which all life returns in the end, through the union of the individual with the universal soul. In the background is the signature Santosh expression of the male and female principles, denoted by the limbs of two individuals in union. Shiva’s trident at the top completes the tantra cosmology."
    },
    {
        "id": 203,
        "posterUrl": "https://images.getbento.com/accounts/3aba79963eaec755ff2b03d837bda6a8/media/images/Khana_Balraj03NY_-_mr.jpg?w=1000&fit=max&auto=compress,format&h=1000",
        "posterSize": "‘Untitled’, 1975, Oil on fabric, 40.0 x 71.5 in.",
        "posterName": "BALRAJ KHANNA",
        "posterYear": "B. 1940",
        "posterDiscription": "Self-taught artist Balraj Khanna, once called ‘one of the most distinguished artists living in England’ by English curator Bryan Robertson, was born in the Punjab in 1940. He acquired a master’s degree in English literature from the Punjab University, Chandigarh, and went to Oxford for further studies in 1962. However, the Indo-China war the same year disrupted his plans and he gradually turned to painting. He developed a unique language in his works, inspired by his childhood, nature and concepts of creation. Khanna is also known for spraying sand on canvas through a special technique while painting, giving rise to finely textured, luminous creations. The sensuality and gentleness in this work is one example of his approach to painting – compelling us as viewers to also have a softness in our gaze. Based in England, he is also a prolific writer and has won the Royal Society of Literature’s Winifred Holtby Prize for his novel, Nation of Fools, in 1984."
    },
    {
        "id": 204,
        "posterUrl": "https://images.getbento.com/accounts/3aba79963eaec755ff2b03d837bda6a8/media/images/ReddyPT137NY.jpg?w=1000&fit=max&auto=compress,format&h=1000",
        "posterSize": "‘Queen at Rest’, 1955, Oil on paper pasted on Masonite board, 34.0 x 41.5 in.",
        "posterName": "P.T. REDDY",
        "posterYear": "1915-96",
        "posterDiscription": "PT Reddy was born to a farmer’s family in Andhra Pradesh’s Karimnagar district. Defying his family’s opposition to art as a professional practice and fascinated with color and form in his childhood, Reddy joined Sir J. J. School of Art, Bombay, to study painting on a scholarship. A sensitive artist, Reddy evolved a unique vision of his own, creating complex compositions, realistic and expressionistic portraits, still-lifes, and impressionistic landscapes. An excellent draughtsman, Reddy’s lines have an even flow, rarely changing in thickness or intensity. He was also trained in mural design and was acquainted with the Rajput and Pahari miniature styles. He received numerous awards from institutions including the Academy of Fine Arts, Calcutta, and the Andhra Pradesh Lalit Kala Akademi."
    },
    {
        "id": 205,
        "posterUrl": "https://images.getbento.com/accounts/3aba79963eaec755ff2b03d837bda6a8/media/images/GUPTABD190NY_-_mr.jpg?w=1000&fit=max&auto=compress,format&h=1000",
        "posterSize": "‘Untitled’, 1971, Oil on jute, 56.00 x 28.00 in.",
        "posterName": "BIMAL DASGUPTA",
        "posterYear": "1917-1995",
        "posterDiscription": "Born in Bengal in 1917, Bimal Dasgupta joined Calcutta’s College of Arts and Crafts in 1937. But the war interrupted his studies and he found himself working as a clerk in a war office where his talents were put to use as assistant director in charge of all artwork for Victory magazine. He eventually went on to teach at College of Art, New Delhi, for fourteen years. Nature was very important to Dasgupta and formed a seminal part of his practice. After an early reputation as a landscape painter, he briefly experimented with cubism after a tour across Europe, and later dabbled in neo-tantrism, marking his abstract phase. He eventually turned to pure abstraction, executed in watercolours and acrylic. Besides exhibiting widely in India and abroad, he also handled commissions for murals for the India pavilions at international trade fairs in Moscow and Tokyo. Dasgupta was honoured by the Sahitya Kala Parishad, New Delhi, in 1972, and made a fellow of the Lalit Kala Akademi in 1989."
    },
    {
        "id": 206,
        "posterUrl": "https://images.getbento.com/accounts/3aba79963eaec755ff2b03d837bda6a8/media/images/BurmanSakti086NY_-_mr.jpg?w=1000&fit=max&auto=compress,format&h=1000",
        "posterSize": "‘Untitled’, 1960, Oil on jute, 28.00 x 35.70 in.",
        "posterName": "SAKTI BURMAN",
        "posterYear": "B. 1935",
        "posterDiscription": "Born in Calcutta, Sakti Burman studied at the city’s Government College of Arts and Crafts, and later at École Nationale des Beaux-Arts, Paris. Like most other Indian artists who studied or lived in the French capital, Paris-based Burman’s works blend European and Indian imagery. Pointillism and a marbling effect are unique characteristics of Burman’s art. He discovered marbling accidentally when water spilled on an oil canvas causing a filigreed dispersal of oil, an effect he has been painstakingly recreating ever since. In 1958, exposure to Italian Renaissance frescos by Giotto, Piero della Francesca and Simone Martini inspired Burman to incorporate the monumentality and texture of their works in his oeuvre. This painting, an early and relatively rare example of abstraction reflects a Parisian landscape, emerging from the canvas through texture and strategic use of color. Burman is married to French artist Maite Deiteil and spends his time between his homes and studios in Paris and New Delhi."
    },
    {
        "id": 207,
        "posterUrl": "https://images.getbento.com/accounts/3aba79963eaec755ff2b03d837bda6a8/media/images/KulkarniKS0534NY_-_mr.jpg?w=1000&fit=max&auto=compress,format&h=1000",
        "posterSize": "‘Untitled’, 1960, Oil on canvas, 47.2 x 37.2 in.",
        "posterName": "K. S. KULKARNI",
        "posterYear": "1916-1994",
        "posterDiscription": "Born in a village in Belgaum in Karnataka in 1916, Kulkarni engaged with modernist techniques and mediums to create a highly individualized pictorial language. Kulkarni imbued his figurative works with the classical grace of Ajanta paintings and a distinctive modernist spirit. While some works evoke village life and are melodious in their composition, his cityscapes show tightly packed blocks rising up in strong outlines. However, he neither idealized rural life nor disparaged urban existence—choosing to paint life as he experienced it. On completing his diploma from Sir J. J. School of Art, Bombay, Kulkarni shifted to Delhi in 1943 to work in textile design. Along with other artists who had moved from Lahore to Delhi following Partition, he became a member of the All India Fine Arts and Crafts Society, and was founder-president of Delhi Silpi Chakra. He was also a founder member of Triveni Kala Sangam, the multi-arts complex in New Delhi. From 1973-78, he served as the vice-chairman of Lalit Kala Akademi, New Delhi."
    }
]